MoseychukA/FLARM_ALL/MAIN_PA/Arhiv/FlyRf24_07_20_01/ESP32RF.cpp
// Callback invoked when received READ10 command.
// Copy disk's data to buffer (up to bufsize) and
// return number of copied bytes (must be multiple of block size)
static int32_t ESP32_msc_read_cb (uint32_t lba, uint32_t offset, void* buffer, uint32_t bufsize)
{
  // Note: SPIFLash Bock API: readBlocks/writeBlocks/syncBlocks
  // already include 4K sector caching internally. We don't need to cache it, yahhhh!!
  return SPIFlash->readBlocks(lba, offset, (uint8_t*) buffer, bufsize/512) ?
         bufsize : -1;
}

// Callback invoked when received WRITE10 command.
// Process data in buffer to disk's storage and
// return number of written bytes (must be multiple of block size)
static int32_t ESP32_msc_write_cb (uint32_t lba, uint32_t offset, uint8_t* buffer, uint32_t bufsize)
{
  // Note: SPIFLash Bock API: readBlocks/writeBlocks/syncBlocks
  // already include 4K sector caching internally. We don't need to cache it, yahhhh!!
  int32_t rval = SPIFlash->writeBlocks(lba, offset, buffer, bufsize/512) ?
                 bufsize : -1;

#if 1
  // sync with flash
  SPIFlash->syncBlocks();

  // clear file system's cache to force refresh
  fatfs.cacheClear();
#endif

  return rval;
}
#endif /* USE_ADAFRUIT_MSC */
#endif /* CONFIG_TINYUSB_MSC_ENABLED */

#if !defined(EXCLUDE_IMU)
#include <SensorQMI8658.hpp>
#include <MPU9250.h>

#define IMU_UPDATE_INTERVAL 500 /* ms */
#define OLED_FLIP_THRESHOLD 0.6

SensorQMI8658 imu_qmi8658;
MPU9250       imu_mpu9250;

static unsigned long IMU_Time_Marker = 0;

#if defined(USE_OLED)
extern int32_t IMU_g_x10;
#endif /* USE_OLED */
#endif /* EXCLUDE_IMU */

#if !defined(EXCLUDE_MAG)
#include <SensorQMC6310.hpp>

#define MAG_UPDATE_INTERVAL 500 /* ms */

SensorQMC6310 mag_qmc6310;

static unsigned long MAG_Time_Marker = 0;

#if defined(USE_OLED)
extern int32_t MAG_heading;
#endif /* USE_OLED */
#endif /* EXCLUDE_MAG */

#include "soc/rtc.h"
static uint32_t calibrate_one(rtc_cal_sel_t cal_clk, const char *name)
{
    const uint32_t cal_count = 1000;
    const float factor = (1 << 19) * 1000.0f;
    uint32_t cali_val;
    for (int i = 0; i < 5; ++i) {
        cali_val = rtc_clk_cal(cal_clk, cal_count);
    }
    return cali_val;
}

#define CALIBRATE_ONE(cali_clk) calibrate_one(cali_clk, #cali_clk)

//#define DEBUG_X32K(s) Serial.println(s)
#define DEBUG_X32K(s) {}

static bool ESP32_has_32k_xtal = false;

#if defined(USE_NEOPIXELBUS_LIBRARY)
NeoPixelBus<NeoGrbFeature, Neo800KbpsMethod> TWR2_Pixel(1, SOC_GPIO_PIN_TWR2_NEOPIXEL);
#endif /* USE_NEOPIXELBUS_LIBRARY */

#if defined(USE_SA8X8)
#include <SA818Controller.h>
extern SA818Controller controller;
#endif /* USE_SA8X8 */
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(ENABLE_D1090_INPUT)
#include <mode-s.h>

mode_s_t state;
#endif /* ENABLE_D1090_INPUT */

static void IRAM_ATTR ESP32_PMU_Interrupt_handler() {
  portENTER_CRITICAL_ISR(&PMU_mutex);
  PMU_Irq = true;
  portEXIT_CRITICAL_ISR(&PMU_mutex);
}

static uint32_t ESP32_getFlashId()
{
  return g_rom_flashchip.device_id;
}

#if defined(CORE_DEBUG_LEVEL) && CORE_DEBUG_LEVEL>0 && !defined(TAG)
#define TAG "MAC"
#endif

static void ESP32_setup()
{
#if !defined(SOFTRF_ADDRESS)

  esp_err_t ret = ESP_OK;
  uint8_t null_mac[6] = {0};

  ret = esp_efuse_mac_get_custom(efuse_mac);
  if (ret != ESP_OK) {
      ESP_LOGE(TAG, "Get base MAC address from BLK3 of EFUSE error (%s)", esp_err_to_name(ret));
    /* If get custom base MAC address error, the application developer can decide what to do:
     * abort or use the default base MAC address which is stored in BLK0 of EFUSE by doing
     * nothing.
     */

    ESP_LOGI(TAG, "Use base MAC address which is stored in BLK0 of EFUSE");
    chipmacid = ESP.getEfuseMac();
  } else {
    if (memcmp(efuse_mac, null_mac, 6) == 0) {
      ESP_LOGI(TAG, "Use base MAC address which is stored in BLK0 of EFUSE");
      chipmacid = ESP.getEfuseMac();
    }
  }
#endif /* SOFTRF_ADDRESS */

#if ESP32_DISABLE_BROWNOUT_DETECTOR
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0);
#endif

  size_t flash_size = spi_flash_get_chip_size();
  size_t min_app_size = flash_size;

  esp_partition_iterator_t it;
  const esp_partition_t *part;

  it = esp_partition_find(ESP_PARTITION_TYPE_APP, ESP_PARTITION_SUBTYPE_ANY, NULL);
  if (it) {
    do {
      part = esp_partition_get(it);
      if (part->subtype == ESP_PARTITION_SUBTYPE_APP_FACTORY) {
        continue;
      }
      if (part->size < min_app_size) {
        min_app_size = part->size;
      }
    } while (it = esp_partition_next(it));

    if (it) esp_partition_iterator_release(it);
  }

  if (min_app_size && (min_app_size != flash_size)) {
    ESP32_Min_AppPart_Size = min_app_size;
  }

  if (psramFound()) {

    uint32_t flash_id = ESP32_getFlashId();

    /*
     *    Board         |   Module      |  Flash memory IC
     *  ----------------+---------------+--------------------
     *  DoIt ESP32      | WROOM         | GIGADEVICE_GD25Q32
     *  TTGO T3  V2.0   | PICO-D4 IC    | GIGADEVICE_GD25Q32
     *  TTGO T3  V2.1.6 | PICO-D4 IC    | GIGADEVICE_GD25Q32
     *  TTGO T22 V06    |               | WINBOND_NEX_W25Q32_V
     *  TTGO T22 V08    |               | WINBOND_NEX_W25Q32_V
     *  TTGO T22 V11    |               | BOYA_BY25Q32AL
     *  TTGO T8  V1.8   | WROVER        | GIGADEVICE_GD25LQ32
     *  TTGO T8 S2 V1.1 |               | WINBOND_NEX_W25Q32_V
     *  TTGO T5S V1.9   |               | WINBOND_NEX_W25Q32_V
     *  TTGO T5S V2.8   |               | BOYA_BY25Q32AL
     *  TTGO T5  4.7    | WROVER-E      | XMC_XM25QH128C
     *  TTGO T-Watch    |               | WINBOND_NEX_W25Q128_V
     *  Ai-T NodeMCU-S3 | ESP-S3-12K    | GIGADEVICE_GD25Q64C
     *  TTGO T-Dongle   |               | BOYA_BY25Q32AL
     *  TTGO S3 Core    |               | GIGADEVICE_GD25Q64C
     *  TTGO T-01C3     |               | BOYA_BY25Q32AL
     *                  | ESP-C3-12F    | XMC_XM25QH32B
     *  LilyGO T-TWR    | WROOM-1-N16R8 | GIGADEVICE_GD25Q128
     *  Heltec Tracker  |               | GIGADEVICE_GD25Q64
     */

    switch(flash_id)
    {
    case MakeFlashId(GIGADEVICE_ID, GIGADEVICE_GD25LQ32):
      /* ESP32-WROVER module with ESP32-NODEMCU-ADAPTER */
      hw_info.model = SOFTRF_MODEL_STANDALONE;
      break;
    case MakeFlashId(WINBOND_NEX_ID, WINBOND_NEX_W25Q128_V):
      hw_info.model = SOFTRF_MODEL_SKYWATCH;
      break;
#if defined(CONFIG_IDF_TARGET_ESP32)
    case MakeFlashId(WINBOND_NEX_ID, WINBOND_NEX_W25Q32_V):
    case MakeFlashId(BOYA_ID, BOYA_BY25Q32AL):
    default:
      hw_info.model = SOFTRF_MODEL_PRIME_MK2;

#else
#error "This ESP32 family build variant is not supported!"
#endif
      break;
    }
  } else {
#if defined(CONFIG_IDF_TARGET_ESP32)
    uint32_t chip_ver = REG_GET_FIELD(EFUSE_BLK0_RDATA3_REG, EFUSE_RD_CHIP_VER_PKG);
    uint32_t pkg_ver  = chip_ver & 0x7;
    if (pkg_ver == EFUSE_RD_CHIP_VER_PKG_ESP32PICOD4) {
      esp32_board    = ESP32_TTGO_V2_OLED;
      lmic_pins.rst  = SOC_GPIO_PIN_TBEAM_RF_RST_V05;
      lmic_pins.busy = SOC_GPIO_PIN_TBEAM_RF_BUSY_V08;
    }
#endif /* CONFIG_IDF_TARGET_ESP32 */
  }

 /* if (SOC_GPIO_PIN_BUZZER != SOC_UNUSED_PIN) {
    ledcAttachPin(SOC_GPIO_PIN_BUZZER, LEDC_CHANNEL_BUZZER);
    ledcSetup(LEDC_CHANNEL_BUZZER, 0, LEDC_RESOLUTION_BUZZER);
  }*/

