MoseychukA/FLARM_ALL/MAIN_PA/Arhiv/FlyRf24_07_20_01/ESP32RF.cpp
#if defined(USE_USB_HOST)
      // DCDC5 1400~3700mV, 100mV/step, 24 steps, IMAX=1A
      axp_2xxx.setDC5Voltage(3700);
#endif /* USE_USB_HOST */

      // ALDO 500~3500V, 100mV/step, IMAX=300mA
      axp_2xxx.setALDO3Voltage(3300); // LoRa, AXP2101 power-on value: 3300
      axp_2xxx.setALDO4Voltage(3300); // GNSS, AXP2101 power-on value: 2900

      axp_2xxx.setALDO2Voltage(3300); // RTC
      axp_2xxx.setALDO1Voltage(3300); // sensors, OLED
      axp_2xxx.setBLDO1Voltage(3300); // uSD

      // axp_2xxx.enableDC1();

#if defined(USE_USB_HOST)
      axp_2xxx.enableDC5();
#endif /* USE_USB_HOST */

      axp_2xxx.enableALDO3();
      axp_2xxx.enableALDO4();

      axp_2xxx.enableALDO2();
      axp_2xxx.enableALDO1();
      axp_2xxx.enableBLDO1();

      axp_2xxx.setChargingLedMode(XPOWERS_CHG_LED_ON);

      pinMode(SOC_GPIO_PIN_S3_PMU_IRQ, INPUT /* INPUT_PULLUP */);

      attachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_S3_PMU_IRQ),
                      ESP32_PMU_Interrupt_handler, FALLING);

      axp_2xxx.disableIRQ(XPOWERS_AXP2101_ALL_IRQ);
      axp_2xxx.clearIrqStatus();

      axp_2xxx.setChargerConstantCurr(XPOWERS_AXP2101_CHG_CUR_500MA);
      axp_2xxx.disableTSPinMeasure();
      axp_2xxx.enableBattVoltageMeasure();

      axp_2xxx.enableIRQ(XPOWERS_AXP2101_PKEY_LONG_IRQ |
                         XPOWERS_AXP2101_PKEY_SHORT_IRQ);

      /* Wake up Quectel L76K GNSS */
      digitalWrite(SOC_GPIO_PIN_S3_GNSS_WAKE, HIGH);
      pinMode(SOC_GPIO_PIN_S3_GNSS_WAKE, OUTPUT);

      Wire1.beginTransmission(PCF8563_SLAVE_ADDRESS);
      bool esp32_has_rtc = (Wire1.endTransmission() == 0);
      if (!esp32_has_rtc) {
        delay(200);
        Wire1.beginTransmission(PCF8563_SLAVE_ADDRESS);
        esp32_has_rtc = (Wire1.endTransmission() == 0);
        if (!esp32_has_rtc) {
          delay(200);
          Wire1.beginTransmission(PCF8563_SLAVE_ADDRESS);
          esp32_has_rtc = (Wire1.endTransmission() == 0);
        }
      }

      i2c = new I2CBus(Wire1);

      if (esp32_has_rtc && (i2c != nullptr)) {
        rtc = new PCF8563_Class(*i2c);

        pinMode(SOC_GPIO_PIN_S3_RTC_IRQ, INPUT);
        hw_info.rtc = RTC_PCF8563;
      }

      /* wait until every LDO voltage will settle down */
      delay(200);

#if !defined(EXCLUDE_MAG)
      bool has_qmc = mag_qmc6310.begin(Wire, QMC6310_SLAVE_ADDRESS,
                                       SOC_GPIO_PIN_S3_SDA, SOC_GPIO_PIN_S3_SCL);
      if (has_qmc) {
        mag_qmc6310.configMagnetometer(
            /*
            * Run Mode
            * MODE_SUSPEND
            * MODE_NORMAL
            * MODE_SINGLE
            * MODE_CONTINUOUS
            * * */
            SensorQMC6310::MODE_NORMAL,
            /*
            * Full Range
            * RANGE_30G
            * RANGE_12G
            * RANGE_8G
            * RANGE_2G
            * * */
            SensorQMC6310::RANGE_2G,
            /*
            * Output data rate
            * DATARATE_10HZ
            * DATARATE_50HZ
            * DATARATE_100HZ
            * DATARATE_200HZ
            * * */
            SensorQMC6310::DATARATE_100HZ,
            /*
            * Over sample Ratio1
            * OSR_8
            * OSR_4
            * OSR_2
            * OSR_1
            * * * */
            SensorQMC6310::OSR_1,

            /*
            * Down sample Ratio1
            * DSR_8
            * DSR_4
            * DSR_2
            * DSR_1
            * * */
            SensorQMC6310::DSR_1);

        hw_info.mag = MAG_QMC6310;
      } else {
        WIRE_FINI(Wire);
      }

      MAG_Time_Marker = millis();
#endif /* EXCLUDE_MAG */

#if !defined(EXCLUDE_IMU)
      imu_qmi8658.setSpiSetting(4000000, MSBFIRST, SPI_MODE0);
      bool has_qmi = imu_qmi8658.begin(SOC_GPIO_PIN_S3_IMU_SS,
                                       SOC_GPIO_PIN_S3_IMU_MOSI,
                                       SOC_GPIO_PIN_S3_IMU_MISO,
                                       SOC_GPIO_PIN_S3_IMU_SCK,
                                       uSD_SPI);
      if (has_qmi) {
        imu_qmi8658.configAccelerometer(
            /*
             * ACC_RANGE_2G
             * ACC_RANGE_4G
             * ACC_RANGE_8G
             * ACC_RANGE_16G
             * */
            SensorQMI8658::ACC_RANGE_4G,
            /*
             * ACC_ODR_1000H
             * ACC_ODR_500Hz
             * ACC_ODR_250Hz
             * ACC_ODR_125Hz
             * ACC_ODR_62_5Hz
             * ACC_ODR_31_25Hz
             * ACC_ODR_LOWPOWER_128Hz
             * ACC_ODR_LOWPOWER_21Hz
             * ACC_ODR_LOWPOWER_11Hz
             * ACC_ODR_LOWPOWER_3H
            * */
            SensorQMI8658::ACC_ODR_1000Hz,
            /*
            *  LPF_MODE_0     //2.66% of ODR
            *  LPF_MODE_1     //3.63% of ODR
            *  LPF_MODE_2     //5.39% of ODR
            *  LPF_MODE_3     //13.37% of ODR
            * */
            SensorQMI8658::LPF_MODE_0,
            // selfTest enable
            true);

        imu_qmi8658.configGyroscope(
            /*
            * GYR_RANGE_16DPS
            * GYR_RANGE_32DPS
            * GYR_RANGE_64DPS
            * GYR_RANGE_128DPS
            * GYR_RANGE_256DPS
            * GYR_RANGE_512DPS
            * GYR_RANGE_1024DPS
            * */
            SensorQMI8658::GYR_RANGE_64DPS,
            /*
             * GYR_ODR_7174_4Hz
             * GYR_ODR_3587_2Hz
             * GYR_ODR_1793_6Hz
             * GYR_ODR_896_8Hz
             * GYR_ODR_448_4Hz
             * GYR_ODR_224_2Hz
             * GYR_ODR_112_1Hz
             * GYR_ODR_56_05Hz
             * GYR_ODR_28_025H
             * */
            SensorQMI8658::GYR_ODR_896_8Hz,
            /*
            *  LPF_MODE_0     //2.66% of ODR
            *  LPF_MODE_1     //3.63% of ODR
            *  LPF_MODE_2     //5.39% of ODR
            *  LPF_MODE_3     //13.37% of ODR
            * */
            SensorQMI8658::LPF_MODE_3,
            // selfTest enable
            true);

        // In 3DOF mode,
        imu_qmi8658.enableAccelerometer();

        hw_info.imu = IMU_QMI8658;
      }

