MoseychukA/FLARM_ALL/MAIN_PA/Arhiv/FlyRf24_07_20_01/ESP32RF.cpp
      IMU_Time_Marker = millis();

      if (hw_info.imu == IMU_NONE) {
        uSD_SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE3));
        digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, LOW);

        // reset device
        uSD_SPI.transfer(MPU6886_REG_PWR_MGMT_1);
        uSD_SPI.transfer(0x80);

        digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, HIGH);
        uSD_SPI.endTransaction();

        delay(100);

        uSD_SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE3));
        digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, LOW);

        uSD_SPI.transfer(MPU6886_REG_WHOAMI | 0x80 /* read */);
        hw_info.imu = (uSD_SPI.transfer(0x00) ==  0x19) ? IMU_MPU6886 : IMU_NONE;

        digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, HIGH);
        uSD_SPI.endTransaction();
      }

      uSD_SPI.end();
#endif /* EXCLUDE_IMU */
    } else {
      WIRE_FINI(Wire1);
      esp32_board      = ESP32_S3_DEVKIT;
      hw_info.model    = SOFTRF_MODEL_STANDALONE;
      hw_info.revision = 203;

#if !defined(EXCLUDE_IMU)
#if 0
      uSD_SPI.begin(SOC_GPIO_PIN_S3_IMU_SCK,
                    SOC_GPIO_PIN_S3_IMU_MISO,
                    SOC_GPIO_PIN_S3_IMU_MOSI,
                    SOC_GPIO_PIN_S3_IMU_SS);
      uSD_SPI.setHwCs(false);

      pinMode(SOC_GPIO_PIN_S3_IMU_SS, OUTPUT);
      digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, HIGH);

      delay(50);

      uSD_SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE3));
      digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, LOW);

      // reset device
      uSD_SPI.transfer(MPU9250_REG_PWR_MGMT_1);
      uSD_SPI.transfer(0x80);

      digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, HIGH);
      uSD_SPI.endTransaction();

      delay(100);

      uSD_SPI.beginTransaction(SPISettings(1000000, MSBFIRST, SPI_MODE3));
      digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, LOW);

      uSD_SPI.transfer(MPU9250_REG_WHOAMI | 0x80 /* read */);
      uint8_t whoami = uSD_SPI.transfer(0x00);
      hw_info.imu = (whoami == 0x71 || whoami == 0x73) ? IMU_MPU9250 : IMU_NONE;

      digitalWrite(SOC_GPIO_PIN_S3_IMU_SS, HIGH);
      uSD_SPI.endTransaction();

      uSD_SPI.end();

      hw_info.mag = (hw_info.imu == IMU_MPU9250) ? MAG_AK8963 : hw_info.mag;
#endif
#endif /* EXCLUDE_IMU */
    }

#if ARDUINO_USB_CDC_ON_BOOT
    SerialOutput.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS,
                       SOC_GPIO_PIN_S3_CONS_RX,
                       SOC_GPIO_PIN_S3_CONS_TX);
#endif /* ARDUINO_USB_CDC_ON_BOOT */

    lmic_pins.nss  = SOC_GPIO_PIN_S3_SS;
    lmic_pins.rst  = SOC_GPIO_PIN_S3_RST;
    lmic_pins.busy = SOC_GPIO_PIN_S3_BUSY;

    ESP32_has_spiflash = SPIFlash->begin(possible_devices,
                                         EXTERNAL_FLASH_DEVICE_COUNT);
    if (ESP32_has_spiflash) {
      spiflash_id = SPIFlash->getJEDECID();

      uint32_t capacity = spiflash_id & 0xFF;
      if (capacity >= 0x17) { /* equal or greater than 1UL << 23 (8 MiB) */
        hw_info.storage = STORAGE_FLASH;

#if CONFIG_TINYUSB_MSC_ENABLED
  #if defined(USE_ADAFRUIT_MSC)
        // Set disk vendor id, product id and revision
        // with string up to 8, 16, 4 characters respectively
        usb_msc.setID(ESP32SX_Device_Manufacturer, "Internal Flash", "1.0");

        // Set callback
        usb_msc.setReadWriteCallback(ESP32_msc_read_cb,
                                     ESP32_msc_write_cb,
                                     ESP32_msc_flush_cb);

        // Set disk size, block size should be 512 regardless of spi flash page size
        usb_msc.setCapacity(SPIFlash->size()/512, 512);

        // MSC is ready for read/write
        usb_msc.setUnitReady(true);

        usb_msc.begin();

  #else

        // Set disk vendor id, product id and revision
        // with string up to 8, 16, 4 characters respectively
        usb_msc.vendorID(ESP32SX_Device_Manufacturer);
        usb_msc.productID("Internal Flash");
        usb_msc.productRevision("1.0");

        // Set callback
        usb_msc.onRead(ESP32_msc_read_cb);
        usb_msc.onWrite(ESP32_msc_write_cb);

        // MSC is ready for read/write
        usb_msc.mediaPresent(true);

        // Set disk size, block size should be 512 regardless of spi flash page size
        usb_msc.begin(SPIFlash->size()/512, 512);
  #endif /* USE_ADAFRUIT_MSC */
#endif /* CONFIG_TINYUSB_MSC_ENABLED */

        FATFS_is_mounted = fatfs.begin(SPIFlash);
      }
    }

    int uSD_SS_pin = (esp32_board == ESP32_S3_DEVKIT) ?
                     SOC_GPIO_PIN_S3_SD_SS_DK : SOC_GPIO_PIN_S3_SD_SS_TBEAM;

    /* uSD-SPI init */
    uSD_SPI.begin(SOC_GPIO_PIN_S3_SD_SCK,
                  SOC_GPIO_PIN_S3_SD_MISO,
                  SOC_GPIO_PIN_S3_SD_MOSI,
                  uSD_SS_pin);

    pinMode(uSD_SS_pin, OUTPUT);
    digitalWrite(uSD_SS_pin, HIGH);

    uSD_is_attached = uSD.cardBegin(SD_CONFIG);

    if (uSD_is_attached && uSD.card()->cardSize() > 0) {
      hw_info.storage = (hw_info.storage == STORAGE_FLASH) ?
                        STORAGE_FLASH_AND_CARD : STORAGE_CARD;
    }

    ui = &ui_settings;

  } else if (hw_info.model == SOFTRF_MODEL_HAM) {
    Wire.begin(SOC_GPIO_PIN_TWR2_SDA , SOC_GPIO_PIN_TWR2_SCL);
    Wire.beginTransmission(AXP2101_SLAVE_ADDRESS);
    bool has_axp2101 = (Wire.endTransmission() == 0) &&
                       axp_2xxx.begin(Wire, AXP2101_SLAVE_ADDRESS,
                                      SOC_GPIO_PIN_TWR2_SDA,
                                      SOC_GPIO_PIN_TWR2_SCL);
    if (has_axp2101) {
      esp32_board      = ESP32_LILYGO_T_TWR_V2_0;
      hw_info.revision = 20;
      hw_info.pmu      = PMU_AXP2101;

      // Set the minimum common working voltage of the PMU VBUS input,
      // below this value will turn off the PMU
      axp_2xxx.setVbusVoltageLimit(XPOWERS_AXP2101_VBUS_VOL_LIM_4V36);

      // Set the maximum current of the PMU VBUS input,
      // higher than this value will turn off the PMU
      axp_2xxx.setVbusCurrentLimit(XPOWERS_AXP2101_VBUS_CUR_LIM_1500MA);

      // DCDC1 1500~3400mV, IMAX=2A
      axp_2xxx.setDC1Voltage(3300); // WROOM, OLED

      // ALDO 500~3500V, 100mV/step, IMAX=300mA
      axp_2xxx.setALDO2Voltage(3300); // micro-SD
      axp_2xxx.setALDO4Voltage(3300); // GNSS, AXP2101 power-on value: 2900

      axp_2xxx.setBLDO1Voltage(3300); // Mic

