MoseychukA/FLARM_ALL/MAIN_PA/Arhiv/FlyRf24_07_20_01/ESP32RF.cpp
      // axp_2xxx.enableDC1();

      axp_2xxx.enableALDO2();
      axp_2xxx.enableALDO4();

      axp_2xxx.enableBLDO1();

      axp_2xxx.setChargingLedMode(XPOWERS_CHG_LED_ON);

      pinMode(SOC_GPIO_PIN_TWR2_PMU_IRQ, INPUT /* INPUT_PULLUP */);

      attachInterrupt(digitalPinToInterrupt(SOC_GPIO_PIN_TWR2_PMU_IRQ),
                      ESP32_PMU_Interrupt_handler, FALLING);

      axp_2xxx.disableIRQ(XPOWERS_AXP2101_ALL_IRQ);
      axp_2xxx.clearIrqStatus();

      axp_2xxx.setChargerConstantCurr(XPOWERS_AXP2101_CHG_CUR_500MA);
      axp_2xxx.disableTSPinMeasure();
      axp_2xxx.enableBattVoltageMeasure();

      axp_2xxx.enableIRQ(XPOWERS_AXP2101_PKEY_LONG_IRQ |
                         XPOWERS_AXP2101_PKEY_SHORT_IRQ);

      /* wait until every LDO voltage will settle down */
      delay(200);

      lmic_pins.nss  = SOC_GPIO_PIN_TWR2_SS;
      lmic_pins.rst  = SOC_UNUSED_PIN;
      lmic_pins.busy = SOC_UNUSED_PIN;

#if defined(USE_NEOPIXELBUS_LIBRARY)
      TWR2_Pixel.Begin();
      TWR2_Pixel.Show(); // Initialize all pixels to 'off'
#endif /* USE_NEOPIXELBUS_LIBRARY */
    } else {
      WIRE_FINI(Wire);

      /* TBD */
    }

#if ARDUINO_USB_CDC_ON_BOOT
    SerialOutput.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS,
                       SOC_GPIO_PIN_TWR2_CONS_RX,
                       SOC_GPIO_PIN_TWR2_CONS_TX);
#endif /* ARDUINO_USB_CDC_ON_BOOT */

    ESP32_has_spiflash = SPIFlash->begin(possible_devices,
                                         EXTERNAL_FLASH_DEVICE_COUNT);
    if (ESP32_has_spiflash) {
      spiflash_id = SPIFlash->getJEDECID();

      uint32_t capacity = spiflash_id & 0xFF;
      if (capacity >= 0x18) { /* equal or greater than 1UL << 24 (16 MiB) */
        hw_info.storage = STORAGE_FLASH;

#if CONFIG_TINYUSB_MSC_ENABLED
  #if defined(USE_ADAFRUIT_MSC)
        // Set disk vendor id, product id and revision
        // with string up to 8, 16, 4 characters respectively
        usb_msc.setID(ESP32SX_Device_Manufacturer, "Internal Flash", "1.0");

        // Set callback
        usb_msc.setReadWriteCallback(ESP32_msc_read_cb,
                                     ESP32_msc_write_cb,
                                     ESP32_msc_flush_cb);

        // Set disk size, block size should be 512 regardless of spi flash page size
        usb_msc.setCapacity(SPIFlash->size()/512, 512);

        // MSC is ready for read/write
        usb_msc.setUnitReady(true);

        usb_msc.begin();

  #else

        // Set disk vendor id, product id and revision
        // with string up to 8, 16, 4 characters respectively
        usb_msc.vendorID(ESP32SX_Device_Manufacturer);
        usb_msc.productID("Internal Flash");
        usb_msc.productRevision("1.0");

        // Set callback
        usb_msc.onRead(ESP32_msc_read_cb);
        usb_msc.onWrite(ESP32_msc_write_cb);

        // MSC is ready for read/write
        usb_msc.mediaPresent(true);

        // Set disk size, block size should be 512 regardless of spi flash page size
        usb_msc.begin(SPIFlash->size()/512, 512);
  #endif /* USE_ADAFRUIT_MSC */
#endif /* CONFIG_TINYUSB_MSC_ENABLED */

        FATFS_is_mounted = fatfs.begin(SPIFlash);
      }
    }

    if (esp32_board == ESP32_LILYGO_T_TWR_V2_0) {
      int uSD_SS_pin = SOC_GPIO_PIN_TWR2_SD_SS;

      /* uSD-SPI init */
      uSD_SPI.begin(SOC_GPIO_PIN_TWR2_SD_SCK,
                    SOC_GPIO_PIN_TWR2_SD_MISO,
                    SOC_GPIO_PIN_TWR2_SD_MOSI,
                    uSD_SS_pin);

      pinMode(uSD_SS_pin, OUTPUT);
      digitalWrite(uSD_SS_pin, HIGH);

      uSD_is_attached = uSD.cardBegin(SD_CONFIG);

      if (uSD_is_attached && uSD.card()->cardSize() > 0) {
        hw_info.storage = (hw_info.storage == STORAGE_FLASH) ?
                          STORAGE_FLASH_AND_CARD : STORAGE_CARD;
      }
    }
  } else if (hw_info.model == SOFTRF_MODEL_MIDI) {

#if ARDUINO_USB_CDC_ON_BOOT
    SerialOutput.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS,
                       SOC_GPIO_PIN_S3_CONS_RX,
                       SOC_GPIO_PIN_S3_CONS_TX);
#endif /* ARDUINO_USB_CDC_ON_BOOT */

    lmic_pins.nss  = SOC_GPIO_PIN_HELTRK_SS;
    lmic_pins.rst  = SOC_GPIO_PIN_HELTRK_RST;
    lmic_pins.busy = SOC_GPIO_PIN_HELTRK_BUSY;

#endif /* CONFIG_IDF_TARGET_ESP32S3 */

#if defined(CONFIG_IDF_TARGET_ESP32C3)
  } else if (esp32_board == ESP32_C3_DEVKIT) {

    lmic_pins.nss  = SOC_GPIO_PIN_C3_SS;
    lmic_pins.rst  = LMIC_UNUSED_PIN;
    lmic_pins.busy = SOC_GPIO_PIN_C3_TXE;

    /* TBD */

#endif /* CONFIG_IDF_TARGET_ESP32C3 */
  }

#if ARDUINO_USB_CDC_ON_BOOT && \
    (defined(CONFIG_IDF_TARGET_ESP32S2) || defined(CONFIG_IDF_TARGET_ESP32S3))
  if (USB.manufacturerName(ESP32SX_Device_Manufacturer)) {
    char usb_serial_number[16];
    uint16_t pid;

    pid = (esp32_board == ESP32_TTGO_T_BEAM_SUPREME) ? SOFTRF_USB_PID_PRIME_MK3  :
          (esp32_board == ESP32_S2_T8_V1_1         ) ? SOFTRF_USB_PID_WEBTOP     :
          (esp32_board == ESP32_S3_DEVKIT          ) ? SOFTRF_USB_PID_STANDALONE :
          (esp32_board == ESP32_LILYGO_T_TWR_V2_0  ) ? SOFTRF_USB_PID_HAM        :
          (esp32_board == ESP32_HELTEC_TRACKER     ) ? SOFTRF_USB_PID_MIDI       :
          USB_PID /* 0x1001 */ ;

    snprintf(usb_serial_number, sizeof(usb_serial_number),
             "%02X%02X%02X%02X%02X%02X",
             efuse_mac[0], efuse_mac[1], efuse_mac[2],
             efuse_mac[3], efuse_mac[4], efuse_mac[5]);

    USB.VID(USB_VID); // USB_ESPRESSIF_VID = 0x303A
    USB.PID(pid);
    USB.productName(esp32_board == ESP32_TTGO_T_BEAM_SUPREME ? ESP32S3_Model_Prime3 :
                    esp32_board == ESP32_LILYGO_T_TWR_V2_0   ? ESP32S3_Model_Ham    :
                    esp32_board == ESP32_HELTEC_TRACKER      ? ESP32S3_Model_Midi   :
                    ESP32SX_Model_Stand);
    USB.firmwareVersion(ESP32SX_Device_Version);
    USB.serialNumber(usb_serial_number);
    USB.begin();
  }

  Serial.begin(SERIAL_OUT_BR);

  for (int i=0; i < 20; i++) {if (Serial) break; else delay(100);}

#if 0 /* TBD */
  if (Serial.rebootEnabled()) {
    Serial.enableReboot(false);
  }
#endif /* TBD */

#else
  Serial.begin(SERIAL_OUT_BR, SERIAL_OUT_BITS);
#endif /* ARDUINO_USB_CDC_ON_BOOT && (CONFIG_IDF_TARGET_ESP32S2 || S3) */

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (esp32_board == ESP32_TTGO_T_BEAM_SUPREME)
  {
    rtc_clk_32k_enable(true);

    CALIBRATE_ONE(RTC_CAL_RTC_MUX);
    uint32_t cal_32k = CALIBRATE_ONE(RTC_CAL_32K_XTAL);

