MoseychukA/FLARM_ALL/MAIN_PA/Arhiv/FlyRf24_07_20_01/ESP32RF.cpp
    if (cal_32k == 0) {
        DEBUG_X32K("32K XTAL OSC has not started up");
    } else {
        rtc_clk_slow_freq_set(RTC_SLOW_FREQ_32K_XTAL);
        DEBUG_X32K("Switching of RTC clock source onto 32768 Hz XTAL is successful.");
        CALIBRATE_ONE(RTC_CAL_RTC_MUX);
        CALIBRATE_ONE(RTC_CAL_32K_XTAL);
    }
    CALIBRATE_ONE(RTC_CAL_RTC_MUX);
    CALIBRATE_ONE(RTC_CAL_32K_XTAL);
    if (rtc_clk_slow_freq_get() != RTC_SLOW_FREQ_32K_XTAL) {
        DEBUG_X32K("Warning: Failed to switch RTC clock source onto 32768 Hz XTAL !");
    } else {
        ESP32_has_32k_xtal = true;
    }
#if !defined(EXCLUDE_IMU)
    if (hw_info.imu             == IMU_QMI8658 /* && */
     /* rtc_get_reset_reason(0) == POWERON_RESET */) {
      for (int i=0; i<50; i++) {
        if (imu_qmi8658.getDataReady()) {
          float a_x, a_y, a_z;
          if (imu_qmi8658.getAccelerometer(a_x, a_y, a_z)) {
            if (a_x > OLED_FLIP_THRESHOLD) {
#if defined(USE_OLED)
              OLED_flip = 1;
#endif /* USE_OLED */
            }
          }
          break;
        } else {
          delay(10);
        }
      }
    }
#endif /* EXCLUDE_IMU */
  } else if (esp32_board == ESP32_LILYGO_T_TWR_V2_0) {

    /* turn SA868 power off  to make sure that SQL is inactive */
    digitalWrite(SOC_GPIO_PIN_TWR2_RADIO_PD, LOW);
    pinMode(SOC_GPIO_PIN_TWR2_RADIO_PD, OUTPUT);

    delay(200);

    calibrate_voltage(ADC1_GPIO2_CHANNEL);
    uint16_t gpio2_voltage = read_voltage(); // avg. of 32 samples

    if (gpio2_voltage > 1900) {
      esp32_board = ESP32_LILYGO_T_TWR_V2_1;
      hw_info.revision = 21;

      axp_2xxx.setALDO3Voltage(3300); // V2.1 - SA868, NeoPixel
      axp_2xxx.enableALDO3();

#if defined(USE_SA8X8)
      if (gpio2_voltage > 2400) {
        controller.setBand(Band::VHF);
      } else {
        controller.setBand(Band::UHF);
      }
#endif /* USE_SA8X8 */
    } else {
      axp_2xxx.setDC3Voltage  (3400); // V2.0 - SA868, NeoPixel
      axp_2xxx.enableDC3();

      pinMode(SOC_GPIO_PIN_TWR2_RADIO_HL, OUTPUT_OPEN_DRAIN);
      digitalWrite(SOC_GPIO_PIN_TWR2_RADIO_HL, LOW);
    }

    digitalWrite(SOC_GPIO_PIN_TWR2_RADIO_PTT, HIGH);
    pinMode(SOC_GPIO_PIN_TWR2_RADIO_PTT,  INPUT_PULLUP);
    pinMode(SOC_GPIO_PIN_TWR2_MIC_CH_SEL, INPUT_PULLUP);

  } else if (esp32_board == ESP32_HELTEC_TRACKER) {

    rtc_clk_32k_enable(true);

    CALIBRATE_ONE(RTC_CAL_RTC_MUX);
    uint32_t cal_32k = CALIBRATE_ONE(RTC_CAL_32K_XTAL);

    if (cal_32k == 0) {
        DEBUG_X32K("32K XTAL OSC has not started up");
    } else {
        rtc_clk_slow_freq_set(RTC_SLOW_FREQ_32K_XTAL);
        DEBUG_X32K("Switching of RTC clock source onto 32768 Hz XTAL is successful.");
        CALIBRATE_ONE(RTC_CAL_RTC_MUX);
        CALIBRATE_ONE(RTC_CAL_32K_XTAL);
    }
    CALIBRATE_ONE(RTC_CAL_RTC_MUX);
    CALIBRATE_ONE(RTC_CAL_32K_XTAL);
    if (rtc_clk_slow_freq_get() != RTC_SLOW_FREQ_32K_XTAL) {
        DEBUG_X32K("Warning: Failed to switch RTC clock source onto 32768 Hz XTAL !");
    } else {
        ESP32_has_32k_xtal = true;
    }

    hw_info.revision = ESP32_has_32k_xtal ? 5 : 3;

    if (hw_info.revision > 3) {
      pinMode(SOC_GPIO_PIN_HELTRK_VEXT_EN, INPUT_PULLUP);
    } else {
      digitalWrite(SOC_GPIO_PIN_HELTRK_GNSS_EN, LOW);
      pinMode(SOC_GPIO_PIN_HELTRK_GNSS_EN, OUTPUT);

      pinMode(SOC_GPIO_PIN_HELTRK_TFT_EN,  INPUT_PULLDOWN);
      pinMode(SOC_GPIO_PIN_HELTRK_VEXT_EN, INPUT_PULLDOWN);
    }

    digitalWrite(SOC_GPIO_PIN_HELTRK_GNSS_RST, LOW);
    pinMode(SOC_GPIO_PIN_HELTRK_GNSS_RST,  OUTPUT);
    delay(100);
    digitalWrite(SOC_GPIO_PIN_HELTRK_GNSS_RST, HIGH);

    pinMode(SOC_GPIO_PIN_HELTRK_ADC_EN,    INPUT_PULLUP);

    digitalWrite(SOC_GPIO_PIN_HELTRK_LED,  LOW);
    pinMode(SOC_GPIO_PIN_HELTRK_LED,       OUTPUT);

  } else {
#if !defined(EXCLUDE_IMU)
    Wire.begin(SOC_GPIO_PIN_S3_SDA, SOC_GPIO_PIN_S3_SCL);
    Wire.beginTransmission(MPU9250_ADDRESS);
    bool has_mpu = (Wire.endTransmission() == 0);

    if (has_mpu && imu_mpu9250.setup(MPU9250_ADDRESS)) {
      imu_mpu9250.verbose(false);
      if (imu_mpu9250.isSleeping()) {
        imu_mpu9250.sleep(false);
      }
      hw_info.imu = IMU_MPU9250;
      IMU_Time_Marker = millis();
    } else {
      WIRE_FINI(Wire);
    }

    hw_info.mag = (hw_info.imu == IMU_MPU9250) ? MAG_AK8963 : hw_info.mag;
#endif /* EXCLUDE_IMU */
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
}

static void ESP32_post_init()
{
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (hw_info.model == SOFTRF_MODEL_PRIME_MK3)
  {
    Serial.println();
    Serial.println(F("Power-on Self Test"));
    Serial.println();
    Serial.flush();

    Serial.println(F("Built-in components:"));

    Serial.print(F("RADIO    : "));
    Serial.println(hw_info.rf      == RF_IC_SX1262 ||
                   hw_info.rf      == RF_IC_SX1276     ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("GNSS     : "));
    Serial.println(hw_info.gnss    != GNSS_MODULE_NONE ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("32K XTAL : "));
    Serial.println(ESP32_has_32k_xtal                  ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("DISPLAY  : "));
    Serial.println(hw_info.display == DISPLAY_OLED_1_3 ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("RTC      : "));
    Serial.println(hw_info.rtc     == RTC_PCF8563      ? F("PASS") : F("FAIL"));
    Serial.flush();
    Serial.print(F("BARO     : "));
    Serial.println(hw_info.baro  == BARO_MODULE_BMP280 ? F("PASS") : F("N/A"));
    Serial.flush();
#if !defined(EXCLUDE_IMU)
    Serial.print(F("IMU      : "));
    Serial.println(hw_info.imu     != IMU_NONE         ? F("PASS") : F("FAIL"));
    Serial.flush();
#endif /* EXCLUDE_IMU */
#if !defined(EXCLUDE_MAG)
    Serial.print(F("MAG      : "));
    Serial.println(hw_info.mag     != MAG_NONE         ? F("PASS") : F("FAIL"));
    Serial.flush();
#endif /* EXCLUDE_MAG */

    Serial.println();
    Serial.println(F("External components:"));
    Serial.print(F("CARD     : "));
    Serial.println(hw_info.storage == STORAGE_CARD ||
                   hw_info.storage == STORAGE_FLASH_AND_CARD
                                                       ? F("PASS") : F("N/A"));
    Serial.flush();

    Serial.println();
    Serial.println(F("Power-on Self Test is complete."));
    Serial.flush();
  }

  if (hw_info.model == SOFTRF_MODEL_PRIME_MK3  ||
      esp32_board   == ESP32_LILYGO_T_TWR_V2_0 ||
      esp32_board   == ESP32_LILYGO_T_TWR_V2_1)
  {
    Serial.println();

