MoseychukA/FLARM_ALL/MAIN_PA/Arhiv/FlyRf24_07_20_01/ESP32RF.cpp
    if (!uSD_is_attached) {
      Serial.println(F("WARNING: unable to attach micro-SD card."));
    } else {
      // The number of 512 byte sectors in the card
      // or zero if an error occurs.
      size_t cardSize = uSD.card()->cardSize();

      if (cardSize == 0) {
        Serial.println(F("WARNING: invalid micro-SD card size."));
      } else {
        uint8_t cardType = uSD.card()->type();

        Serial.print(F("SD Card Type: "));
        if(cardType == SD_CARD_TYPE_SD1){
            Serial.println(F("V1"));
        } else if(cardType == SD_CARD_TYPE_SD2){
            Serial.println(F("V2"));
        } else if(cardType == SD_CARD_TYPE_SDHC){
            Serial.println(F("SDHC"));
        } else {
            Serial.println(F("UNKNOWN"));
        }

        Serial.print("SD Card Size: ");
        Serial.print(cardSize / (2 * 1024));
        Serial.println(" MB");
      }
    }
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

  Serial.println();
  Serial.println(F("Data output device(s):"));

  Serial.print(F("NMEA   - "));
  switch (settings->nmea_out)
  {
    case NMEA_UART       :  Serial.println(F("UART"));      break;
    case NMEA_USB        :  Serial.println(F("USB CDC"));   break;
    case NMEA_UDP        :  Serial.println(F("UDP"));       break;
    case NMEA_TCP        :  Serial.println(F("TCP"));       break;
    case NMEA_BLUETOOTH  :  Serial.println(F("Bluetooth")); break;
    case NMEA_OFF        :
    default              :  Serial.println(F("NULL"));      break;
  }

  Serial.print(F("GDL90  - "));
  switch (settings->gdl90)
  {
    case GDL90_UART      :  Serial.println(F("UART"));      break;
    case GDL90_USB       :  Serial.println(F("USB CDC"));   break;
    case GDL90_UDP       :  Serial.println(F("UDP"));       break;
    case GDL90_BLUETOOTH :  Serial.println(F("Bluetooth")); break;
    case GDL90_OFF       :
    default              :  Serial.println(F("NULL"));      break;
  }

  Serial.print(F("D1090  - "));
  switch (settings->d1090)
  {
    case D1090_UART      :  Serial.println(F("UART"));      break;
    case D1090_USB       :  Serial.println(F("USB CDC"));   break;
    case D1090_BLUETOOTH :  Serial.println(F("Bluetooth")); break;
    case D1090_OFF       :
    default              :  Serial.println(F("NULL"));      break;
  }

  Serial.println();
  Serial.flush();

  switch (hw_info.display)
  {
#if defined(USE_OLED)
  case DISPLAY_OLED_TTGO:
  case DISPLAY_OLED_HELTEC:
  case DISPLAY_OLED_1_3:
    OLED_info1();

#if defined(CONFIG_IDF_TARGET_ESP32S3)
    if (hw_info.model == SOFTRF_MODEL_PRIME_MK3)
    {
      char key[8];
      char out[64];
      uint8_t tokens[3] = { 0 };
      cdbResult rt;
      int c, i = 0, token_cnt = 0;

      int acfts;
      char *reg, *mam, *cn;
      reg = mam = cn = NULL;

      OLED_info2();

      if (ADB_is_open) {
        acfts = ucdb.recordsNumber();

        snprintf(key, sizeof(key),"%06X", ThisAircraft.addr);

        rt = ucdb.findKey(key, strlen(key));

        switch (rt) {
          case KEY_FOUND:
            while ((c = ucdb.readValue()) != -1 && i < (sizeof(out) - 1)) {
              if (c == '|') {
                if (token_cnt < (sizeof(tokens) - 1)) {
                  token_cnt++;
                  tokens[token_cnt] = i+1;
                }
                c = 0;
              }
              out[i++] = (char) c;
            }
            out[i] = 0;

            reg = out + tokens[1];
            mam = out + tokens[0];
            cn  = out + tokens[2];

            break;

          case KEY_NOT_FOUND:
          default:
            break;
        }

        reg = (reg != NULL) && strlen(reg) ? reg : (char *) "REG: N/A";
        mam = (mam != NULL) && strlen(mam) ? mam : (char *) "M&M: N/A";
        cn  = (cn  != NULL) && strlen(cn)  ? cn  : (char *) " CN: N/A";

      } else {
        acfts = -1;
      }

      OLED_info3(acfts, reg, mam, cn);
    }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

    break;
#endif /* USE_OLED */
  case DISPLAY_NONE:
  default:
    break;
  }
}

static void ESP32_loop()
{
  bool is_irq = false;
  bool down = false;

  switch (hw_info.pmu)
  {
  case PMU_AXP192:
  case PMU_AXP202:

    portENTER_CRITICAL_ISR(&PMU_mutex);
    is_irq = PMU_Irq;
    portEXIT_CRITICAL_ISR(&PMU_mutex);

    if (is_irq) {

      if (axp_xxx.readIRQ() == AXP_PASS) {

        if (axp_xxx.isPEKLongtPressIRQ()) {
          down = true;
#if 0
          Serial.println(F("Long press IRQ"));
          Serial.flush();
#endif
        }
        if (axp_xxx.isPEKShortPressIRQ()) {
#if 0
          Serial.println(F("Short press IRQ"));
          Serial.flush();
#endif
#if defined(USE_OLED)
          OLED_Next_Page();
#endif
        }

        axp_xxx.clearIRQ();
      }

      portENTER_CRITICAL_ISR(&PMU_mutex);
      PMU_Irq = false;
      portEXIT_CRITICAL_ISR(&PMU_mutex);

      if (down) {
        shutdown(SOFTRF_SHUTDOWN_BUTTON);
      }
    }

    if (isTimeToBattery()) {
      if (Battery_voltage() > Battery_threshold()) {
        axp_xxx.setChgLEDMode(AXP20X_LED_LOW_LEVEL);
      } else {
        axp_xxx.setChgLEDMode(AXP20X_LED_BLINK_1HZ);
      }
    }
    break;

  case PMU_AXP2101:
    portENTER_CRITICAL_ISR(&PMU_mutex);
    is_irq = PMU_Irq;
    portEXIT_CRITICAL_ISR(&PMU_mutex);

    if (is_irq) {

      axp_2xxx.getIrqStatus();

      if (axp_2xxx.isPekeyLongPressIrq()) {
        down = true;
      }
      if (axp_2xxx.isPekeyShortPressIrq()) {
#if defined(USE_OLED)
        OLED_Next_Page();
#endif
      }

      axp_2xxx.clearIrqStatus();

      portENTER_CRITICAL_ISR(&PMU_mutex);
      PMU_Irq = false;
      portEXIT_CRITICAL_ISR(&PMU_mutex);

      if (down) {
        shutdown(SOFTRF_SHUTDOWN_BUTTON);
      }
    }

    if (isTimeToBattery()) {
      if (Battery_voltage() > Battery_threshold()) {
        axp_2xxx.setChargingLedMode(XPOWERS_CHG_LED_ON);
      } else {
        axp_2xxx.setChargingLedMode(XPOWERS_CHG_LED_BLINK_1HZ);
      }
    }
    break;

  case PMU_NONE:
  default:
    break;
  }

#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (!RTC_sync) {
    if (rtc &&
        gnss.date.isValid()                         &&
        gnss.time.isValid()                         &&
        gnss.date.year() >= fw_build_date_time.year &&
        gnss.date.year() <  fw_build_date_time.year + 15 ) {
      rtc->setDateTime(gnss.date.year(),   gnss.date.month(),
                       gnss.date.day(),    gnss.time.hour(),
                       gnss.time.minute(), gnss.time.second());
      RTC_sync = true;
    }
  }

  #if !defined(EXCLUDE_IMU)
  if ((millis() - IMU_Time_Marker) > IMU_UPDATE_INTERVAL) {

    switch (hw_info.imu)
    {
    case IMU_MPU9250:
      if (imu_mpu9250.update()) {
        float a_x = imu_mpu9250.getAccX();
        float a_y = imu_mpu9250.getAccY();
        float a_z = imu_mpu9250.getAccZ();
    #if defined(USE_OLED)
        IMU_g_x10 = (int) (sqrtf(a_x*a_x + a_y*a_y + a_z*a_z) * 10);
    #endif /* USE_OLED */
      }
      break;
    case IMU_QMI8658:
      if (imu_qmi8658.getDataReady()) {
        float a_x, a_y, a_z;
        if (imu_qmi8658.getAccelerometer(a_x, a_y, a_z)) {
    #if 0
            Serial.print("{ACCEL: ");
            Serial.print(a_x);
            Serial.print(",");
            Serial.print(a_y);
            Serial.print(",");
            Serial.print(a_z);
            Serial.println("}");
    #endif
    #if defined(USE_OLED)
          IMU_g_x10 = (int) (sqrtf(a_x*a_x + a_y*a_y + a_z*a_z) * 10);
    #endif /* USE_OLED */
        }
      }
      break;
    case IMU_NONE:
    default:
      break;
    }

