MoseychukA/FLARM_ALL/MAIN_PA/Arhiv/FlyRf24_07_20_01/ESP32RF.cpp
    IMU_Time_Marker = millis();
  }
  #endif /* !EXCLUDE_IMU */

  #if !defined(EXCLUDE_MAG)
  if ((millis() - MAG_Time_Marker) > MAG_UPDATE_INTERVAL) {

    switch (hw_info.mag)
    {
    case MAG_QMC6310:
      if (mag_qmc6310.isDataReady()) {
        mag_qmc6310.readData();

        float m_x = mag_qmc6310.getX();
        float m_y = mag_qmc6310.getY();
        float m_z = mag_qmc6310.getZ();
        float angle = atan2(-m_z, m_x);
        if (angle < 0) {
          angle += 2 * PI;
        }
    #if defined(USE_OLED)
        MAG_heading = (int) (angle * 180 / M_PI);
    #endif /* USE_OLED */
    #if 0
        Serial.print("MAG");
        Serial.print(" X:");
        Serial.print(m_x);
        Serial.print(" Y:");
        Serial.print(m_y);
        Serial.print(" Z:");
        Serial.print(m_z);
        Serial.print(" uT");
        Serial.print(" H:");
        Serial.println(MAG_heading);
    #endif
      }
      break;
    case MAG_NONE:
    default:
      break;
    }

    MAG_Time_Marker = millis();
  }
  #endif /* !EXCLUDE_MAG */

  if (esp32_board == ESP32_HELTEC_TRACKER) {
    digitalWrite(SOC_GPIO_PIN_HELTRK_LED,
                 digitalRead(SOC_GPIO_PIN_HELTRK_GNSS_PPS));
  }
#endif /* CONFIG_IDF_TARGET_ESP32S3 */
}

static void ESP32_fini(int reason)
{
#if defined(CONFIG_IDF_TARGET_ESP32S3)
  if (ESP32_has_spiflash) {
#if CONFIG_TINYUSB_MSC_ENABLED
  #if defined(USE_ADAFRUIT_MSC)
    usb_msc.setUnitReady(false);
//  usb_msc.end(); /* N/A */
  #else
    usb_msc.mediaPresent(false);
    usb_msc.end();
  #endif /* USE_ADAFRUIT_MSC */
#endif /* CONFIG_TINYUSB_MSC_ENABLED */
  }

  if (SPIFlash != NULL) SPIFlash->end();

#if !defined(EXCLUDE_IMU)
  switch (hw_info.imu)
  {
  case IMU_MPU9250:
    imu_mpu9250.sleep(true);
    break;
  case IMU_QMI8658:
    imu_qmi8658.deinit();
    break;
  case IMU_NONE:
  default:
    break;
  }
#endif /* EXCLUDE_IMU */

#if !defined(EXCLUDE_MAG)
  switch (hw_info.mag)
  {
  case MAG_QMC6310:
    mag_qmc6310.deinit();
    break;
  case MAG_NONE:
  default:
    break;
  }
#endif /* EXCLUDE_MAG */

  if (hw_info.storage == STORAGE_CARD ||
      hw_info.storage == STORAGE_FLASH_AND_CARD) {
    uSD.end();
  }

  uSD_SPI.end();
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

  SPI.end();

  esp_wifi_stop();

#if defined(CONFIG_IDF_TARGET_ESP32)
  esp_bt_controller_disable();
#endif /* CONFIG_IDF_TARGET_ESP32 */

  if (hw_info.model == SOFTRF_MODEL_SKYWATCH) {

    axp_xxx.setChgLEDMode(AXP20X_LED_OFF);

    axp_xxx.setPowerOutPut(AXP202_LDO2, AXP202_OFF); // BL
    axp_xxx.setPowerOutPut(AXP202_LDO4, AXP202_OFF); // S76G (Sony GNSS)
    axp_xxx.setPowerOutPut(AXP202_LDO3, AXP202_OFF); // S76G (MCU + LoRa)

    delay(20);

#if !defined(CONFIG_IDF_TARGET_ESP32C3)
    esp_sleep_enable_ext1_wakeup(1ULL << SOC_GPIO_PIN_TWATCH_PMU_IRQ,
                                 ESP_EXT1_WAKEUP_ALL_LOW);
#endif /* CONFIG_IDF_TARGET_ESP32C3 */
  } else if (hw_info.model == SOFTRF_MODEL_PRIME_MK2 ||
             hw_info.model == SOFTRF_MODEL_PRIME_MK3) {

    switch (hw_info.pmu)
    {
    case PMU_AXP192:
      axp_xxx.setChgLEDMode(AXP20X_LED_OFF);

#if PMK2_SLEEP_MODE == 2
      { int ret;
      // PEK or GPIO edge wake-up function enable setting in Sleep mode
      do {
          // In order to ensure that it is set correctly,
          // the loop waits for it to return the correct return value
          ret = axp_xxx.setSleep();
          delay(500);
      } while (ret != AXP_PASS) ; }

      // Turn off all power channels, only use PEK or AXP GPIO to wake up

      // After setting AXP202/AXP192 to sleep,
      // it will start to record the status of the power channel that was turned off after setting,
      // it will restore the previously set state after PEK button or GPIO wake up

#endif /* PMK2_SLEEP_MODE */

      axp_xxx.setPowerOutPut(AXP192_LDO2,  AXP202_OFF);
      axp_xxx.setPowerOutPut(AXP192_LDO3,  AXP202_OFF);
      axp_xxx.setPowerOutPut(AXP192_DCDC2, AXP202_OFF);

      /* workaround against AXP I2C access blocking by 'noname' OLED */
#if defined(USE_OLED)
      if (u8x8 == NULL)
#endif /* USE_OLED */
      {
        axp_xxx.setPowerOutPut(AXP192_DCDC1, AXP202_OFF);
      }
      axp_xxx.setPowerOutPut(AXP192_EXTEN, AXP202_OFF);

      delay(20);

      /*
       * When driven by SoftRF the V08+ T-Beam takes:
       * in 'full power' - 160 - 180 mA
       * in 'stand by'   - 600 - 900 uA
       * in 'power off'  -  50 -  90 uA
       * of current from 3.7V battery
       */
#if   PMK2_SLEEP_MODE == 1
      /* Deep sleep with wakeup by power button click */
      esp_sleep_enable_ext1_wakeup(1ULL << SOC_GPIO_PIN_TBEAM_V08_PMU_IRQ,
                                 ESP_EXT1_WAKEUP_ALL_LOW);
#elif PMK2_SLEEP_MODE == 2
      // Cut MCU power off, PMU remains in sleep until wakeup by PEK button press
      axp_xxx.setPowerOutPut(AXP192_DCDC3, AXP202_OFF);
#else
      /*
       * Complete power off
       *
       * to power back on either:
       * - press and hold PWR button for 1-2 seconds then release, or
       * - cycle micro-USB power
       */
      axp_xxx.shutdown();
#endif /* PMK2_SLEEP_MODE */
      break;

    case PMU_AXP2101:
      axp_2xxx.setChargingLedMode(XPOWERS_CHG_LED_OFF);

      axp_2xxx.disableButtonBatteryCharge();

      axp_2xxx.disableALDO2();
      axp_2xxx.disableALDO3();

      delay(20);

      /*
       * Complete power off
       *
       * to power back on either:
       * - press and hold PWR button for 1-2 seconds then release, or
       * - cycle micro-USB power
       */
      axp_2xxx.shutdown();
      break;

    case PMU_NONE:
    default:
      break;
    }
  } else if (esp32_board == ESP32_S2_T8_V1_1) {
    pinMode(SOC_GPIO_PIN_T8_S2_PWR_EN, INPUT);

#if !defined(CONFIG_IDF_TARGET_ESP32C3)
    esp_sleep_enable_ext1_wakeup(1ULL << SOC_GPIO_PIN_T8_S2_BUTTON,
                                 ESP_EXT1_WAKEUP_ALL_LOW);
#endif /* CONFIG_IDF_TARGET_ESP32C3 */

  } else if (esp32_board == ESP32_LILYGO_T_TWR_V2_0 ||
             esp32_board == ESP32_LILYGO_T_TWR_V2_1) {

#if defined(CONFIG_IDF_TARGET_ESP32S3)
#if defined(USE_NEOPIXELBUS_LIBRARY)
    TWR2_Pixel.SetPixelColor(0, LED_COLOR_BLACK);
    TWR2_Pixel.Show();
#endif /* USE_NEOPIXELBUS_LIBRARY */
#endif /* CONFIG_IDF_TARGET_ESP32S3 */

    switch (hw_info.pmu)
    {
    case PMU_AXP2101:
      axp_2xxx.setChargingLedMode(XPOWERS_CHG_LED_OFF);

      axp_2xxx.disableButtonBatteryCharge();

      axp_2xxx.disableBLDO1();
      axp_2xxx.disableALDO4();
      axp_2xxx.disableALDO2();

      axp_2xxx.disableALDO3();
      axp_2xxx.disableDC3();

      delay(20);

